app/controllers/pokemons_controller.rb

  def capture
    pokemon = Pokemon.find(params[:id])
    pokemon.trainer = current_trainer
    pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 1], ["updated_at", "2018-10-23 15:35:01.790039"], ["id", 1]]

  def damage
    pokemon = Pokemon.find(params[:id])
    pokemon.health -= 10
    if pokemon.health <= 0
      pokemon.destroy
    else
      pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 1]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2018-10-25 18:49:05.544085"], ["id", 1]]

  def create
    pokemon = Pokemon.new(params.require(:pokemon).permit(:name, :ndex))
		pokemon.update(level: 1, health: 100, trainer_id: current_trainer.id)
    if pokemon.save
---
INSERT INTO "pokemons" ("name", "level", "trainer_id", "ndex", "created_at", "updated_at", "health") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "fff"], ["level", 1], ["trainer_id", 5], ["ndex", 17], ["created_at", "2018-10-25 19:42:09.129022"], ["updated_at", "2018-10-25 19:42:09.129022"], ["health", 100]]